OdStreamBuf.getShareMode
\details
Returns the share mode for this StreamBuf object.
\remarks
getShareMode returns one of the following:
Name                         Value       Description
Oda::kShareDenyReadWrite     0x10        deny read/write mode
Oda::kShareDenyWrite         0x20        deny write mode
Oda::kShareDenyRead          0x30        deny read mode
Oda::kShareDenyNo            0x40        deny none mode
\details
Returns the share mode for this StreamBuf object.
\remarks
getShareMode returns one of the following:
Name                         Value       Description
Oda::kShareDenyReadWrite     0x10        deny read/write mode
Oda::kShareDenyWrite         0x20        deny write mode
Oda::kShareDenyRead          0x30        deny read mode
Oda::kShareDenyNo            0x40        deny none mode

OdStreamBuf.copyDataTo(OdStreamBuf*,System.UInt64,System.UInt64)
\details
Copies the specified bytes from this StreamBuf object to the specified StreamBuf object.
\param pDestination [in]  Pointer to the StreamBuf object to receive the data.
\param sourceStart [in]  Starting position of the file pointer of this StreamBuf object.
\param sourceEnd [in]  Ending position of the file pointer of this StreamBuf object.
\remarks
Bytes are copied from sourceStart to sourceEnd inclusive.

OdStreamBuf.putBytes(System.Void!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Writes the specified number of bytes, starting at the current position of the file pointer
for this StreamBuf object, and increments the pointer by numBytes.
\param buffer [in]  Character buffer.
\param numBytes [in]  Number of bytes.

OdStreamBuf.putByte(System.Byte)
\details
Writes the byte to the current position of the file pointer
for this StreamBuf object, and increments the pointer.
\param value [in]  Byte to write.

OdStreamBuf.getBytes(System.Void*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the specified number of bytes, starting at the current position of the file pointer
for this StreamBuf object, and increments the pointer by numBytes.
\param buffer [in]  Character buffer.
\param numBytes [in]  Number of bytes.

OdStreamBuf.getByte
\details
Returns the byte at the current position of the file pointer
for this StreamBuf object, and increments the pointer.

OdStreamBuf.seek(System.Int64,OdDb.FilerSeekType)
\details
Moves the current position of the file pointer for
this StreamBuf object to the specified location.
\param offset [in]  Number of bytes.
\param seekType [in]  Seek type.
\remarks
seekType must be one of the following:
Name                    Value       Description.
OdDb::kSeekFromStart    SEEK_SET    Start of file.
OdDb::kSeekFromCurrent  SEEK_CUR    Current position of file pointer.
OdDb::kSeekFromEnd      SEEK_END    End of file.

OdStreamBuf.rewind
\details
Sets the current position of the file pointer for
this StreamBuf object to zero.

OdStreamBuf.truncate
\details
Sets the length of the file associated with
this StreamBuf object to zero.

OdStreamBuf.length
\details
Returns the length in bytes of the file associated with
this StreamBuf object.

OdStreamBuf.tell
\details
Returns the current position of the file pointer for
this StreamBuf object.

OdStreamBuf.isEof
\details
Returns true if and only if the current position of the file pointer for
this StreamBuf object is at the end of file.

OdStreamBuf.fileName
\details
Returns the name of the file associated with this StreamBuf object.